In [9]:
import numpy as np
import pandas as pd
title=pd.read_csv("titles.csv")
title.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

How many movies are listed in the titles dataframe?

In [14]:
print("No of movies listed are",title.count())

No of movies listed are title    244914
year     244914
dtype: int64

What are the earliest two films listed in the titles dataframe?

In [17]:
sortedtitle=title.sort_values('year')
sortedtitle.head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

How many movies have the title "Hamlet"?

In [21]:
len1=len(title[title["title"]=="Hamlet"])
print("No of movies having the title Hamlet",len1)

No of movies having the title Hamlet 20

How many movies are titled "North by Northwest"?

In [24]:
len1=len(title[title["title"]=="North by Northwest"])
len1

1

When was the first movie titled "Hamlet" made?

In [28]:
title[title["title"]=="Hamlet"].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

List all of the "Treasure Island" movies from earliest to most recent.

In [31]:
treasure=title[title["title"]=="Treasure Island"].sort_values('year')
print("List of Treasure Island movies from earliest to most recent")
treasure

List of Treasure Island movies from earliest to most recent

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

How many movies were made in the year 1950?

In [34]:
print("No of movies made in the year 1950:",len(title[title["year"]==1950]))

No of movies made in the year 1950: 1113

How many movies were made in the year 1960?

In [35]:
print("No of movies made in the year 1960:",len(title[title["year"]==1960]))

No of movies made in the year 1960: 1549

How many movies were made from 1950 through 1959?

In [40]:
print("No of movies made from the year 1950 to 1959 are:",len(title[(title["year"] >= 1950) & (title["year"] <=1959)]))

No of movies made from the year 1950 to 1959 are: 12934

In what years has a movie titled "Batman" been released?

In [44]:
bat=title[title["title"]=="Batman"]
bat

         title  year
39349   Batman  1943
240896  Batman  1989